{
    "tabsTitles": {
        "home": "Hello!",
        "about": "About",
        "skills": "Skills",
        "projects": "Projects",
        "experience": "Experience"
    },
    "homeCard": {
        "helloText": "Hi, I am",
        "nameText": "Pedro T Freidinger,",
        "smallIntroText": "an entry-level Software Engineer and Computer Science student passionated about building reliable, world-class software products, travelling and languages.",
        "nextCardButtonText": "About me"
    },
    "aboutCard": {
        "avatarAltText": "Picture of Pedro Tersetti Freidinger",
        "nextCardButtonText": "Skills & Abilities",
        "previousCardButtonText": "Welcome Message",
        "paragraphs": [
            "My name is Pedro Tersetti Freidinger and I am passionated about learning, building, fixing and making stuff work. My interest for engineering aroused back when I was about 10 years old by reading books about computers and then, a few time later, building my first computer from scratch.",
            "It was during 2018, when I enrolled in the Bachelor of Science & Technology course at Federal Univerisity of ABC (Brazil), that I decided that solving problems and building things is what I want to do for a living. Since then I have been foccused on majoring Computer Science.",
            "My journey in Software Engineering began oficially in March 2022, when I had the opportunity to take part in an internship program at one of the biggest bureaus of credit in Brazil. Since then I have been actively taking part in software design, documentation, management, lifecycle and, of course, development activities. Unofficially, I have been in touch with the Software Engineering field since somewhere between 2020 and 2021, when I started taking more advanced courses in college such as distributed systems and algorithms. Before diving deep in Software Engineering, I also worked in the Cybersecurity field and took part in an internship in Systems Management for about 5 months.",
            "Beyond the Software Engineering world I am interested in Artificial Intelligence, Cloud Computing, data, moutain biking, travelling, reading and writing. As a matter of languages, my mother tongue is Portuguese but I also speak English, a little of Spanish and Hungarian."
        ],
        "titleText": "About me"
    },
    "skillsCard": {
        "nextCardButtonText": "Projects",
        "previousCardButtonText": "About Me",
        "titleText": "Skills & Abilities",
        "skills": {
            "recentlyWorkedWithTechnologies": [
                "ASP.NET",
                ".NET core",
                "C#",
                "React",
                "Typescript",
                "JavaScript",
                "Google Cloud Plataform",
                "Messaging",
                "Kubernetes",
                "Docker",
                "Python",
                "BigQuery",
                "SQL Server",
                "Linux",
                "Windows Server",
                "Microservices"
            ],
            "otherTechnologies": [
                "Java",
                "Java Spring",
                "PowerShell",
                "Bash",
                "Apache Zookeper",
                "API Gateways",
                "C",
                "C++"
            ],
            "learningTechnologies": [
                "Canary",
                "Terraform",
                "Skala",
                "Apache Spark",
                "Go lang",
                "Open Source AI Frameworks",
                "UI/UX"
            ]
        },
        "recentlyWorkedWithTechnologiesTitle": "Technologies I have worked with recently",
        "otherTechnologiesTitle": "Other technologies",
        "learningTechnologiesTitle": "Near future technologies and skills",
        "skilsAndAbilitiesAbstractText": "Since I started messing around with computers and tech books when I was a kid, I started developing a strong self-learning skill that has helped me in learning programming and spoken languages in an effective and reliable manner. The self-learning skill has also helped me to boost my abilities of planning and organizing, persistency, and analytical thinking skills, mostly due to the fact that making mistakes and learning by past mistakes became a natural activity for me. Besides that, during my professional and college experiences I have developed and improved critical skills, such as software and systems documentation, project elaboration and presentation, communication, leadership and teamwork. Below there is a summary of the technologies I have been working with recently, other technologies I have some experience working with and I also leave a spoiler about technologies that I am planning on getting familiar with in the near future."
    },
    "projectsCard": {
        "nextCardButtonText": "Professional Experience",
        "previousCardButtonText": "Skills & Abilities",
        "titleText": "Some projects I've worked in",
        "projectsAbstractText": "Since most of the projects that I have worked in are confidential information in the companies I worked for, I try to summarize here the most that I can to tell the world about the amazing experiences I have had. Even though I don't have any Open Source Software contribution to present yet, I am a supporter of OS software.",
        "projects": [
            {
                "title": "Legacy system migration to microservices architecture",
                "descriptionParagraphs": [
                    "During my professional experience, I have worked in collaboration with a team in the migration of two huge monolithic applications, written in .NET Framework, to a microservices architecture using up to date versions of .NET core, the C# language, TypeScript and React. I like to highlight two challenges as the biggest ones during this migration projects: i) the challenge to keep the legacy system working side-by-side and collaboratively with the already migrated to microservices architecture parts of the system; ii) the challenge to learn the logic and business rules behind the legacy system, discuss and plan with the tech and business teams how to improve these rules in order to make the new small parts of the system better.",
                    "During the project I was mainly responsible for the backend design, development and documentation, but also helped in the frontend development. Given that, during the project development I was working with C#, SQL Server, TypeScript, React, BigQuery and unit testing in both back and frontend.",
                    "The migration of the legacy monolithic system to the microservices architecture was part of the digital transformation strategy of the company. Each small piece of the legacy system that was migrated brought us (the team) a huge ammount of data that we later, during agile meetings and learning journals, transformed into knowledge, specially when it comes to those two challenges that have been highlighted above."
                ]
            },
            {
                "title": "This portfolio",
                "descriptionParagraphs": [
                    "I have built this portfolio website to be my welcome card in about one week. Since graphic design is not one of my strengths (I hope to change that in the future), I took advantage of the Material UI library to make the place look minimal and, up to some extent, pretty.",
                    "The website is built using React as framework and TypeScript as programming language. It features multi-lingual support and the whole code base is publicly availabe on GitHub."
                ],
                "url": "https://github.com/pedroter7/portfolio",
                "urlLinkText": "Visit the portfolio project on GitHub"
            },
            {
                "title": "Reactive Floating Point Game",
                "descriptionParagraphs": [
                    "Built in February 2022, Reactive Floating Point Game, or RFP - The Game, is a simple Flappy Bird-like browser game built using React. I decided to write this little game in order to put the recent React knowledge that I acquired in practice.",
                    "The game is pretty simple. It reinveints the wheel in some aspects and uses \"old\" React practices, such as explicit state variables, and pure CSS. The game code is available publicly on GitHub and there is a GitHub Pages environment where you can play the game."
                ],
                "url": "https://github.com/pedroter7/reactive-floating-point-game",
                "urlLinkText": "Visit the game project on GitHub"
            }
        ]
    },
    "experienceCard": {
        "previousCardButtonText": "Projects",
        "titleText": "My Professional Experience",
        "experienceCardAbstractText": "My professional experiences started oficially around November 2020, when I enrolled in my first internship program in Cybersecurity. After Cybersecurity, I went to the Systems Administration field and then ended up in Software Engineering, where I finally found myself. This page provides some details about my professional life.",
        "experiences": [
            {
                "field": "Software Engineering",
                "detailsParagraphs": [
                    "I started my career in Software Engineering around March 2022 by enrolling in an internship program at one of the biggest credit bureaus of Brazil, called Boa Vista Serviços, where I am working currently. Since the internship beginning, I have been working in the Software Engineering team for one of the company's products called Bluebox. Bluebox is a SaaS (Software as a Service) plataform where the clients can apply intelligence to data from Boa Vista in an on demand fashion, in order to enrich their client database and make more assertive decisions regarding their business.",
                    "In the Bluebox team I work as a Backend Software Engineer Intern, collaborating with the team during planning, development and deployment of microservices and other kinds of services such as background workers (or jobs), legacy system maintenance, documentation and eventually helping the frontend engineers as well. Besides those tasks I am also involved in strategic meetings where I try to be the most active and assertive as possible.",
                    "Concerning the Software Engineer position, for the backend I have experience working with .NET (both framework and core) using the C# language, SQL databases and Google Cloud Platform services such as BigQuery and Pub/Sub. For the frontend I have experience working with TypeScript, JavaScript and the React framework. Generally speaking I have experience deploying and managing services on Google Cloud Platform, planning and developing for microservices architecture, unit tests planing and development in both frontend and backend, and living in an agile and quickly growing environment."
                ]
            },
            {
                "field": "Other Fields",
                "detailsParagraphs": [
                    "In November 2020, I enrolled in my first internship program at a company called SEC4YOU Cybersecurity (Brazil), where I learned a lot about Information Security, in special access authorization/authentication and Identity Management. After six months of this internship I was hired to work as an IT/IS Analyst, position that I occupied until September 2021 when I decided to enroll in yet another internship program, this time in Systems Administration at T-Systems (Brazil).",
                    "During my experience in the Cybersecurity field I worked with small to medium sized banks and their mobile applications. I worked on a daily basis with API Gateways, such as the Broadcom Layer 7 API Gateway, security policies revision and deployment, and MFA plataforms. I also had experiences working with mobile application development, Linux Server management, web API developent and deployment and lots of documentation.",
                    "From September 2021 to February 2022, I was a Systems Adminstration Intern at T-Systems do Brasil, where I helped the team with Electronic Data Interchange (EDI) infrastructure maintenance and deployment, where I had a lot of contact with Windows Server administration and on-premises Kubernetes cluster management."
                ]
            }
        ]
    },
    "footerTexts": {
        "contactMeText": "Reach me:",
        "sendMeMailText": "E-mail me at",
        "linkedinLinkToolTipText": "Visit my LinkedIn",
        "githubLinkToolTipText": "Visit my GitHub Profile",
        "languageText": "Language:"
    }
}