{
    "tabsTitles": {
        "home": "Olá!",
        "about": "Sobre",
        "skills": "Skills",
        "projects": "Projetos",
        "experience": "Experiência"
    },
    "homeCard": {
        "helloText": "Olá, eu sou",
        "nameText": "Pedro T Freidinger,",
        "smallIntroText": "um engenheiro de software com 1+ anos de experiência construindo softwares confiáveis com qualidade top de linha. Também sou apaixonado por idiomas, cultura, viagens, ciclismo e muito mais. Por favor, sinta-se à vontade :)",
        "nextCardButtonText": "Sobre mim"
    },
    "aboutCard": {
        "avatarAltText": "Foto de Pedro Tersetti Freidinger",
        "nextCardButtonText": "Skills",
        "previousCardButtonText": "Boas Vindas",
        "paragraphs": [
            "Meu nome é Pedro Tersetti Freidinger, e eu sou uma pessoa apaixonada por aprender sobre, construir e arrumar coisas. Meu interesse por engenharia surgiu quando eu tinha cerca de 10 anos de idade enquanto lia livros sobre computadores, e, um tempo depois, quando montava meu primeiro computador do zero.",
            "Durante o ano de 2018, quando entrei para o Bacharelado em Ciência & Tecnologia na Universidade Federal do ABC, decidi que resolver problemas e construir coisas é o que mais me motiva a viver.",
            "Minha carreira em Engenharia de Software começou oficialmente em março de 2022, quando tive a oportunidade de iniciar em um programa de estágio em um dos maiores birôs de crédito do Brasil. Desde então, faço parte ativamente em atividades de design, documentação, administração, ciclo de vida e desenvolvimento de software.",
            "De forma não-oficial, eu estou em contato com a área de software desde meados de 2020/21, quando comecei a cursar disciplinas mais avançadas na universidade, como sistemas distribuídos e algoritmos. Antes de me aventurar profundamente na Engenharia de Software, eu trabalhei na área de Cybersegurança por cerca de 1 ano, e também estive em um programa de estágio em Infraestrutura de TI por cerca de 5 meses.",
            "Fora do mundo da Engenharia de Software, tenho interesse em Inteligência Artificial, Computação em Nuvem, dados, aprender idiomas, pedalar, viajar, ler e escrever. No que diz respeito à idiomas, meu idioma nativo é o português mas eu também falo inglês e um pouco de espanhol e húngaro."
        ],
        "titleText": "About me"
    },
    "skillsCard": {
        "nextCardButtonText": "Projetos",
        "previousCardButtonText": "Sobre mim",
        "titleText": "Habilidades",
        "skills": {
            "recentlyWorkedWithTechnologies": [
                "ASP.NET",
                ".NET core",
                "C#",
                "React",
                "Typescript",
                "JavaScript",
                "Google Cloud Plataform",
                "Messaging",
                "Kubernetes",
                "Docker",
                "Python",
                "BigQuery",
                "SQL Server",
                "Linux",
                "Windows Server",
                "Microserviços"
            ],
            "otherTechnologies": [
                "Java",
                "Java Spring",
                "PowerShell",
                "Bash",
                "Apache Zookeper",
                "API Gateways",
                "C",
                "C++"
            ],
            "learningTechnologies": [
                "Canary",
                "Terraform",
                "Skala",
                "Apache Spark",
                "Go lang",
                "Frameworks de IA de código aberto",
                "UI/UX"
            ]
        },
        "recentlyWorkedWithTechnologiesTitle": "Tecnologias com as quais trabalhei recentemente",
        "otherTechnologiesTitle": "Outras tecnologias",
        "learningTechnologiesTitle": "Tecnologias e habilidades para o futuro",
        "skilsAndAbilitiesAbstractText": "Desde que comecei a mexer com computadores e ler livros de tecnologia quando era criança, comecei a desenvolver um forte autodidatismo, habilidade que me ajudou em aprender linguagens de programação e idiomas de uma forma bastante efetiva. Ser autodidata também me ajudou a alavancar minhas habilidades de planejamento, organização, persistência e pensamento analítico, principalmente dado o fato de que errar e aprender com os erros se tornou algo natural para mim com o tempo. Além disso, durante minhas experiências acadêmicas e profissionais, desenvolvi e melhorei alguns skills críticos como a documentação de software e sistemas, elaboração e apresentação de projetos, comunicação, liderança e trabalho em equipe. Abaixo há um resumo sobre as tecnologias com que trabalhei recentemente, outras tecnologias que conheço e um spoiler sobre tecnologias e habilidades que pretendo aprender ou aperfeiçoar no futuro próximo."
    },
    "projectsCard": {
        "nextCardButtonText": "Experiência Profissional",
        "previousCardButtonText": "Skills",
        "titleText": "Alguns projetos em que trabalhei",
        "projectsAbstractText": "Como a maioria dos projetos em que trabalhei são informação confidencial nas companhias para as quais trabalhei, eu tento resumir nessa página com o máximo de informação possível para mostrar ao mundo as experiências que tive. Apesar de eu não ter ainda nenhuma contribuição para projetos de Software de Código Aberto, sou um adepto dos OSSs.",
        "projects": [
            {
                "title": "Migração de sistema legado para arquitetura de microserviços",
                "descriptionParagraphs": [
                    "Durante minha experiência profissional, trabalhei em colaboração com um time na migração de duas aplicações, construídas no modelo de monolíto em .NET Framework, para uma arquitetura de microserviços utilizando versões atuais do .NET core, da linguagem C# e do framework React. Eu gosto de destacar dois desafios como os maiores desafios dessas migrações:",
                    "i) o desafio de manter o sistema legado funcionando lado-a-lado e colaborativamente com as partes já migradas para a arquitetura de microserviços;",
                    "ii) o desafio de aprender sobre a lógica e regras de negócio embutidas nas aplicações legadas, discutir e planejar com o time técnico e de negócio como melhorar essas regras para que os novos pequenos pedaços do software sejam melhores que o legado.",
                    "Durante o projeto, fui responsável principalmente pela parte de design, desenvolvimento e documentação do backend dos microserviços, porém também ajudei o time em algumas tarefas de frontend. Durante o desenvolvimento do projeto eu trabalhei com C#, SQL Server, TypeScript, React, BigQuery e testes unitários tanto no backend quanto no frontend.",
                    "A migração dos sistemas legados para a arquitetura de microserviços era parte da jornada de transformação digital da empresa. Cada pequena parte do sistema legado que era migrada trouxe para o time uma vasta quantidade de dados que nós, durante reuniões ágeis e learning journals, transformamos em conhecimento, especialmente quando os dados estavam relacionados aos dois desafios citados anteriormente."
                ]
            },
            {
                "title": "Esse portfólio",
                "descriptionParagraphs": [
                    "Eu construi esse portfólio para ser meu cartão de visitas. Como design gráfico não é um dos meus fortes (e espero mudar isso no futuro), utilizei a biblioteca Material UI para fazer as coisas parecerem mais minimalistas, polidas e, até certo ponto, bonitas por aqui.",
                    "O website foi construído em cerca de uma semana, e utiliza React como framework e TypeScript como linguagem de programação. O portfólio tem suporte multílingue e todo o código está disponível publicamente no GitHub."
                ],
                "url": "https://github.com/pedroter7/portfolio",
                "urlLinkText": "Visite o projeto do portfólio no GitHub"
            },
            {
                "title": "Reactive Floating Point Game",
                "descriptionParagraphs": [
                    "Construído em fevereiro de 2022, Reactive Floating Point Game, ou RFP - The Game, é um jogo de navegador no estilo Flappy Bird, construído utilizando React. Eu decidi construir esse joguinho para colocar meus conhecimentos recém-adquiridos em React em prática.",
                    "O jogo é bastante simples. O código reinventa a roda em alguns aspectos e utiliza práticas \"antigas\" de React, como variáveis explícitas de estado e CSS puro. O código do jogo está publicamente disponível no GitHub e há um ambiente GitHub Pages onde é possível jogá-lo."
                ],
                "url": "https://github.com/pedroter7/reactive-floating-point-game",
                "urlLinkText": "Visite o projeto do jogo no GitHub"
            }
        ]
    },
    "experienceCard": {
        "previousCardButtonText": "Projetos",
        "titleText": "Minha Experiência Profissional",
        "experienceCardAbstractText": "Minha experiência profissional tem início oficialmente em novembro de 2020, quando entrei para um programa de estágio em Cybersegurança. Após Cybersegurança, passei pela área de Administração de Sistemas e, no começo de 2022, entrei para a área de Engenharia de Software, onde sinto que finalmente me encontrei. Essa página trás alguns detalhes da minha vida profissional.",
        "experiences": [
            {
                "field": "Engenharia de Software",
                "detailsParagraphs": [
                    "Eu comecei minha carreira em Engenharia de Software por volta de março de 2022, quando fui selecionado para um programa de estágio em um dos maiores birôs de crédito do Brasil, chamado Boa Vista Serviços, onde estou até o presente. Desde o começo do estágio, estive trabalhando no time de Engenharia de Software de um dos produtos da companhia chamado Bluebox. O Bluebox é uma plataforma do tipo SaaS (Software as a Service) onde os clientes podem aplicar inteligência nos dados da Boa Vista de uma forma on demand para enriquecimento de sua base de clientes, tomando assim decisões mais assertivas com relação a seus negócios.",
                    "No time Bluebox eu trabalho como Estagiário de Engenharia de Software no backend, colaborando com o time durante planejamento, desenvolvimento, deploy e manutenção de microserviços e outros tipos de serviços, como background workers (ou simplesmente jobs), manutenção de sistemas legados, documentações e eventualmente ajudando os engenheiros de frontend. Além dessas tarefas, eu faço parte de reuniões estratégicas onde eu tento ao máximo ser o mais ativo e assertivo possível.",
                    "Com relação à posição de Engenheiro de Software, no backend eu possuo experiência trabalhando com .NET (tanto framework como core) utilizando C# como linguagem de programação, base de dados SQL e serviços da Google Cloud Plataform, como o BigQuery e Pub/Sub. No frotend eu tenho experiência trabalhando com TypeSCript, JavaScript e o framework React. Numa visão geral, tenho experiência com deploy e manutenção de serviços na Google Cloud Plataform, planejamento e desenvolvimento para arquitetura de microserviços, planejamento e desenvolvimento de testes unitários tanto no backend quanto no frontend e vivência em um ambiente ágil e crescente."
                ]
            },
            {
                "field": "Outras Áreas",
                "detailsParagraphs": [
                    "Em novembro de 2020, fiz parte do meu primeiro estágio em uma companhia chamada SEC4YOU Cybersecurity, onde aprendi muito sobre segurança da informação, em especial sobre autorização/autenticação de acessos e administração de identidades. Após seis meses de estágio, fui contratado pela mesma empresa para a posição de analista de TI/SI, posição que ocupei até setembro de 2021 quando decidi entrar para outro programa de estágio, dessa vez na área de Administração de Sistemas, na T-Systems do Brasil.",
                    "Durante minha experiência com Cybersegurança, trabalhei principalmente com bancos de pequeno à médio porte e seus aplicativos móveis. Estive em contato diariamente com API Gateways, como o Layer 7 API Gateway da Broadcom, revisão e desenvolvimento de políticas de segurança e plataformas de MFA. Eu também tive experiências com desenvolvimento de aplicações móveis, administração de servidores Linux, desenvolvimento e deploy de web APIs e muitas documentações.",
                    "De setembro de 2021 à fevereiro de 2022, fui estagiário de administração de sistemas na T-Systems do Brasil, onde eu auxiliava o time com a manutenção e deploy de infraestrutura de Electronic Data Interchange (EDI). Durante essa experiência tive contato com atividades e rotinas de administração de servidores Windows e de clusters Kubernetes on-premises."
                ]
            }
        ]
    },
    "footerTexts": {
        "contactMeText": "Entre em contato:",
        "sendMeMailText": "E-mail para:",
        "linkedinLinkToolTipText": "Visite meu perfil no LinkedIn",
        "githubLinkToolTipText": "Visite meu perfil no GitHub",
        "languageText": "Idioma:"
    }
}